{"backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"filters": 64, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_constraint": null, "batch_input_shape": [null, 80, 80, 3], "bias_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_1", "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"filters": 64, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_2", "kernel_regularizer": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [1, 1], "padding": "valid", "pool_size": [1, 1], "name": "max_pooling2d_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 128, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_3", "kernel_regularizer": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 128, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_4", "kernel_regularizer": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [3, 3], "padding": "valid", "pool_size": [3, 3], "name": "max_pooling2d_2", "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "rate": 0.5, "trainable": true, "seed": null}}, {"class_name": "Conv2D", "config": {"filters": 256, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "use_bias": true, "name": "conv2d_5", "kernel_regularizer": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_3", "trainable": true}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 256, "name": "dense_1", "kernel_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "rate": 0.5, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 128, "name": "dense_2", "kernel_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "softmax", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 3, "name": "dense_3", "kernel_regularizer": null, "trainable": true}}]}}